{
  "upload-file": "Carica file",
  "upload-description": {
    "0": "Benvenuto nell'IFC Model Checker!",
    "1": "L'obiettivo di questo strumento è fornire una rapida panoramica delle condizioni di un modello. Include diversi test standard - se questi hanno successo, vale la pena esaminare più a fondo il modello.",
    "2": "L'abbiamo progettato per essere semplice e sicuro.",
    "3": "Tutti i dati rimangono sul tuo computer locale - nessun dato verrà inviato altrove, tutti i controlli vengono eseguiti localmente."
  },
  "upload-description-ids": {
    "0": "Benvenuto nel validatore IDS!",
    "1": "Questo strumento ti aiuta a verificare se i tuoi modelli IFC sono conformi ai requisiti IDS (Information Delivery Specification). Esegue un controllo completo rispetto alle regole definite nel tuo file IDS.",
    "2": "L'abbiamo progettato per essere semplice e sicuro.",
    "3": "Tutta la validazione viene eseguita localmente nel tuo browser utilizzando WASM - i tuoi dati non lasciano mai il tuo dispositivo.",
    "4": "I risultati sono forniti in un rapporto dettagliato che puoi visualizzare online, scaricare come HTML, stampare in PDF o esportare come BCF per un ulteriore utilizzo nel tuo flusso di lavoro BIM."
  },
  "upload-card": {
    "title": "Validazione del modello e regole",
    "description": "IFC Model Checker evidenzia i problemi comunemente riscontrati nei file .ifc, portando a dati di alta qualità nell'industria AEC. Il controllo dei file IFC caricati avviene completamente lato client, non salviamo alcun dato - nulla lascia il tuo dispositivo e tutto viene eliminato dopo la chiusura della sessione.",
    "rules": "Regole",
    "info-card": {
      "0": "Validazione nome progetto: Assicura che ogni progetto abbia un nome significativo e valido.",
      "1": "Associazioni progetto: Verifica che tutti gli elementi relativi al progetto siano correttamente collegati.",
      "2": "Validazione nome sito: Conferma che i nomi dei siti siano definiti correttamente.",
      "3": "Associazioni sito: Controlla il corretto collegamento degli elementi relativi al sito.",
      "4": "Validazione nome edificio: Assicura che gli edifici nel progetto abbiano nomi chiari e validi.",
      "5": "Associazioni edificio: Valida le connessioni tra edifici e altri elementi.",
      "6": "Validazione piani: Conferma che ogni edificio abbia una struttura di piani valida.",
      "7": "Validazione nome piani: Assicura che ogni piano di un edificio sia nominato correttamente.",
      "8": "Associazioni piani: Verifica che gli elementi siano appropriatamente associati ai rispettivi piani.",
      "9": "Validazione nome spazi: Assicura che tutti gli spazi siano nominati in modo chiaro e accurato.",
      "10": "Validazione nome oggetti: Conferma che tutti gli oggetti nel progetto abbiano nomi validi.",
      "11": "Validazione descrizione oggetti: Assicura che ogni oggetto abbia una descrizione appropriata.",
      "12": "Validazione nome tipo: Verifica che i tipi siano nominati correttamente, evitando ambiguità.",
      "13": "Associazioni materiali: Assicura che tutti gli oggetti abbiano definizioni di materiali associate.",
      "14": "Controllo tipi predefiniti: Conferma che i tipi predefiniti siano validi (non UNDEFINED).",
      "15": "Validazione elementi: Identifica i BuildingElementProxies."
    }
  },
  "validate": "Convalida",
  "dropzone": {
    "drag": {
      "ifc": "Trascina i file IFC qui o clicca per selezionare",
      "ids": "Trascina il file IDS qui o clicca per selezionare"
    },
    "error-message": "Errore",
    "attach": "Puoi aggiungere più file",
    "attach-single": "Può essere aggiunto solo un file"
  },
  "results": "Risultati",
  "print": "Stampa",
  "result-table": {
    "rule": "Regola",
    "status": "Stato",
    "level-of-fulfilment": "Livello di conformità",
    "passed": "Superato",
    "failed": "Fallito",
    "statistics": "Statistiche",
    "all-data": "Tutti i dati",
    "count": "Conteggio",
    "other": "Altro"
  },
  "rules": {
    "project-name": "Il nome IfcProject è compilato?",
    "site-name": "Il nome IfcSite è compilato?",
    "building-name": "Il nome IfcBuilding è compilato?",
    "story-name": "I nomi IfcBuilding Storey sono compilati?",
    "story-relation": "Tutti gli oggetti hanno una relazione con un BuildingStory?",
    "building-relation": "Tutti gli oggetti hanno una relazione con un edificio?",
    "site-relation": "Tutti gli oggetti hanno una relazione con un sito?",
    "project-relation": "Tutti gli oggetti hanno una relazione con un progetto?",
    "space-name": "Se ci sono IfcSpaces, hanno il nome compilato?",
    "object-name": "Tutti gli oggetti hanno un nome?",
    "type-name": "Tutti gli oggetti hanno un nome tipo?",
    "object-description": "Tutti gli oggetti hanno una descrizione?",
    "material-name": "Tutti gli oggetti hanno un nome materiale?",
    "predefined-type": "Se gli oggetti hanno un tipo predefinito, sono definiti?",
    "object-count": "Quota di IfcBuildingElementProxy utilizzati:",
    "project-names": "Nome progetto IFC utilizzato",
    "site-names": "Nome sito IFC utilizzato",
    "building-names": "Nome edificio IFC utilizzato",
    "story-names": "Nomi piani IFC utilizzati",
    "object-names": "Nomi oggetti IFC utilizzati",
    "type-names": "Nome tipo oggetto IFC utilizzato",
    "descriptions": "Descrizione oggetto IFC utilizzata",
    "material-names": "Nome materiale oggetto IFC utilizzato",
    "predefined-types": "Tipo predefinito oggetto IFC utilizzato",
    "building-element-proxies": "Tutti i BuildingElementProxy hanno un nome?"
  },
  "validation-type": "Tipo di validazione",
  "ids-validation": "Validazione IDS",
  "standard-validation": "Validazione standard",
  "Upload": {
    "idsValidation": "Abilita validazione IDS",
    "dropIdsFile": "Trascina il file IDS qui",
    "dropIdsFileDescription": "Trascina e rilascia il tuo file IDS (Information Delivery Specification) qui"
  },
  "sponsored-by": "Sponsorizzato da:",
  "open-source": "Open Source su:",
  "author": "Autore",
  "exported": "Esportato",
  "report-format": "Formato rapporto",
  "html-report": "Rapporto HTML (visualizza nel browser)",
  "bcf-report": "Rapporto BCF (scarica per strumenti BIM)",
  "report-format-description": "Seleziona uno o più formati di rapporto. I rapporti HTML possono essere visualizzati e stampati direttamente, mentre i rapporti BCF possono essere utilizzati negli strumenti di collaborazione BIM.",
  "view-html": "HTML",
  "download-bcf": "BCF",
  "select-report-format": "Seleziona almeno un formato di rapporto"
}
