{
  "upload-file": "Upload File",
  "upload-card": {
    "title": "Model Validation and Rules",
    "description": "IFC Model Checker points to commonly found issues in .ifc files, leading to high quality data in the AEC industry. Checking your uploaded IFC files happens fully clientside, we don't save any data - nothing leaves your device and everything is deleted after session gets closed.",
    "rules": "Rules:",
    "info-card": {
      "0": "Project Name Validation: Ensures every project has a meaningful and valid name.",
      "1": "Project Associations: Verifies that all project-related elements are correctly linked.",
      "2": "Site Name Validation: Confirms that site names are properly defined.",
      "3": "Site Associations: Checks the proper linkage of site-related elements.",
      "4": "Building Name Validation: Ensures buildings within the project have clear and valid names.",
      "5": "Building Associations: Validates connections between buildings and other elements.",
      "6": "Building Story Validation: Confirms that every building has a valid story structure.",
      "7": "Story Name Validation: Ensures that every story or floor within a building is named correctly.",
      "8": "Story Associations: Verifies that elements are appropriately associated with their respective stories.",
      "9": "Space Name Validation: Ensures that all spaces are named clearly and accurately.",
      "10": "Object Name Validation: Confirms that all objects in the project have valid names.",
      "11": "Object Description Validation: Ensures that every object has a proper description.",
      "12": "Type Name Validation: Verifies that types are named correctly, avoiding ambiguities.",
      "13": "Material Associations: Ensures that all objects have associated material definitions.",
      "14": "Predefined Type Check: Confirms that predefined types are valid (not UNDEFINED).",
      "15": "Element Validation: Identifies BuildingElementProxies."
    }
  },
  "validate": "Validate",
  "dropzone": {
    "drag": "Drag IFC files here or click to select files",
    "attach": "Attach as many files as you like, each file should not exceed 500Mb",
    "error": "Invalid file type. Only .ifc files are allowed.",
    "error-message": "File"
  },
  "results": "Results",
  "print": "Print",
  "result-table": {
    "rule": "Rule",
    "status": "Status",
    "level-of-fulfilment": "Level of Fulfilment",
    "passed": "Passed",
    "failed": "Failed",
    "statistics": "Statistics",
    "all-data": "All Data",
    "count": "Count",
    "other": "Other"
  },
  "rules": {
    "project-name": "Is IfcProject Name filled out?",
    "site-name": "Is IfcSite Name filled out?",
    "building-name": "Is IfcBuilding Name filled out?",
    "story-name": "Are IfcBuilding Storey Names filled out?",
    "story-relation": "Do, all Objects have a relation to a BuildingStory?",
    "building-relation": "Do all Objects have a relation to a Building?",
    "site-relation": "Do all Objects have a relation to a Site?",
    "project-relation": "Do all Objects have a relation to a Project?",
    "space-name": "If there are IfcSpaces, do they have the Name filled out?",
    "object-name": "Do all Objects have a Name?",
    "type-name": "Do all Objects have a Type Name?",
    "object-description": "Do all Objects have a Description?",
    "material-name": "Do all Objects have a Material Name?",
    "predefined-type": "If Objects have a Predefined Type, are they defined?",
    "object-count": "No IfcBuildingElementProxy used?",
    "project-names": "IFC Project Name used",
    "site-names": "IFC Site Name used",
    "building-names": "IFC Building Name used",
    "story-names": "IFC Building Storey Names used",
    "object-names": "IFC Object Names used",
    "type-names": "IFC Object TypeName used",
    "descriptions": "IFC Object Description used",
    "material-names": "IFC Object MaterialName used",
    "predefined-types": "IFC Object Predefined Type used",
    "building-element-proxies": "IFC BuildingElementProxy Name used"
  }
}